#include<stdio.h>
struct information
{
	int k;char country[20];char name[30];float score1;
	float score2;float score3;float score4;float score5;float total;
}b[12],c[12],d[12],e[12],f[12],g[12];
struct biaotou
{
	char li[20]; char cou[20];char lift[20];char yi[20];
	char er[20];char san[20];char si[20];char wu[20];char t[20];char paixu[20];
};
int main()
{   
        int h,j;
        int jk[12]={1,2,3,4,5,6,7,8,9,10,11,12};
    printf("********************************************************比赛开始**********************************************************\n\n");
	    int i;
	    struct biaotou a={"序号","国家或地区","姓名","第一轮成绩","第二轮成绩","第三轮成绩","第四轮成绩","第五轮成绩","总分","排名"};
	printf("%s %16s\t%10s\t%20s %s %s %s %s %s\n\n",a.li,a.cou,a.lift,a.yi,a.er,a.san,a.si,a.wu,a.t);
	    struct information b[12]={{1,"墨西哥","奥罗斯科-洛萨",0},
	{2,"德国","纬纱",0},
	{3,"荷兰","范杜因-席琳",0},
	{4,"英国","图尔森",0},
	{5,"英国","斯潘多利尼-西里耶克斯",0},
	{6,"马来西亚","潘德莱拉-帕姆",0},
	{7,"俄罗斯","季莫申宁娜-尤利娅",0},
	{8,"澳大利亚","梅丽莎-吴",0},
	{9,"墨西哥","阿贡德斯-加西亚",0},
	{10,"美国","施奈尔",0},
	{11,"中国","陈芋汐",0},
	{12,"中国","全红禅",0}};
	    for(i=0;i<12;i++)
    printf("%2d%17s\t%-16s\t%61.1f\n\n",b[i].k,b[i].country,b[i].name,b[i].total);
    printf("********************************************************第一轮记分********************************************************\n\n");
	printf("%s %16s\t%10s\t%20s %s %s %s %s %s\n\n",a.li,a.cou,a.lift,a.yi,a.er,a.san,a.si,a.wu,a.t);	
	    struct information c[12]={{1,"墨西哥","奥罗斯科-洛萨",66.0,0,0,0,0},
	{2,"德国","纬纱",67.2,0,0,0,0},
	{3,"荷兰","范杜因-席琳",50.4,0,0,0,0},
	{4,"英国","图尔森",63.0,0,0,0,0},
	{5,"英国","斯潘多利尼-西里耶克斯",58.5,0,0,0,0},
	{6,"马来西亚","潘德莱拉-帕姆",18.0,0,0,0,0},
	{7,"俄罗斯","季莫申宁娜-尤利娅",46.5,0,0,0,0},
	{8,"澳大利亚","梅丽莎-吴",75.0,0,0,0,0},
	{9,"墨西哥","阿贡德斯-加西亚",64.5,0,0,0,0},
	{10,"美国","施奈尔",76.8,0,0,0,0},
	{11,"中国","陈芋汐",82.5,0,0,0,0},
	{12,"中国","全红禅",82.5,0,0,0,0}};
	    for(i=0;i<12;i++)
    printf("%2d%17s\t%-16s\t%10.2f%11.2f%11.2f%11.2f%10.2f%10.2f\n\n",c[i].k,c[i].country,c[i].name,c[i].score1,c[i].score2,c[i].score3,c[i].score4,c[i].score5,c[i].total=c[i].score1+c[i].score2+c[i].score3+c[i].score4+c[i].score5);
    printf("********************************************************第一轮排序********************************************************\n\n");
	printf("%s %16s\t%4s\t%25s%18s\n\n",a.li,a.cou,a.lift,a.t,a.paixu); 
	    struct information t;
        int l,r;
        for(l=0;l<11;l++)
    {
    h=l;
    	for(r=l+1;r<12;r++)
    	if(c[r].total>c[h].total)
    h=r;
    t=c[h];c[h]=c[l];c[l]=t;
    }
        for(i=0;i<12;i++)
    printf("%2d%17s\t%-16s\t%10.2f\t%10d\n\n",c[i].k,c[i].country,c[i].name,c[i].total,jk[i]);
    printf("********************************************************第二轮记分********************************************************\n\n");
    printf("%s %16s\t%10s\t%20s %s %s %s %s %s\n\n",a.li,a.cou,a.lift,a.yi,a.er,a.san,a.si,a.wu,a.t);	
	    struct information d[12]={{1,"墨西哥","奥罗斯科-洛萨",66.0,57.6,0,0,0},
	{2,"德国","纬纱",67.2,63.0,0,0,0},
	{3,"荷兰","范杜因-席琳",50.4,49.3,0,0,0},
	{4,"英国","图尔森",63.0,37.8,0,0,0},
	{5,"英国","斯潘多利尼-西里耶克斯",58.5,60.8,0,0,0},
	{6,"马来西亚","潘德莱拉-帕姆",18.0,71.05,0,0,0},
	{7,"俄罗斯","季莫申宁娜-尤利娅",46.5,57.75,0,0,0},
	{8,"澳大利亚","梅丽莎-吴",75.0,76.8,0,0,0},
	{9,"墨西哥","阿贡德斯-加西亚",64.5,70.95,0,0,0},
	{10,"美国","施奈尔",76.8,65.6,0,0,0},
	{11,"中国","陈芋汐",82.5,76.8,0,0,0},
	{12,"中国","全红禅",82.5,96.0,0,0,0}};
	    for(i=0;i<12;i++)
    printf("%2d%17s\t%-16s\t%10.2f%11.2f%11.2f%11.2f%10.2f%10.2f\n\n",d[i].k,d[i].country,d[i].name,d[i].score1,d[i].score2,d[i].score3,d[i].score4,d[i].score5,d[i].total=d[i].score1+d[i].score2+d[i].score3+d[i].score4+d[i].score5);
    printf("********************************************************第二轮排序********************************************************\n\n");
	printf("%s %16s\t%4s\t%25s%18s\n\n",a.li,a.cou,a.lift,a.t,a.paixu);
	    struct information t1;
        int l1,r1;
        for(l1=0;l1<11;l1++)
    {
    h=l;
    	for(r1=l1+1;r1<12;r1++)
    	if(d[r1].total>d[h].total)
    h=r1;
    t1=d[h];d[h]=d[l1];d[l1]=t1;
    }
        for(i=0;i<12;i++)
    printf("%2d%17s\t%-16s\t%10.2f\t%10d\n\n",d[i].k,d[i].country,d[i].name,d[i].total,jk[i]);
    printf("********************************************************第三轮记分********************************************************\n\n");
    printf("%s %16s\t%10s\t%20s %s %s %s %s %s\n\n",a.li,a.cou,a.lift,a.yi,a.er,a.san,a.si,a.wu,a.t);	
	    struct information e[12]={{1,"墨西哥","奥罗斯科-洛萨",66.0,57.6,54.45,0,0},
	{2,"德国","纬纱",67.2,63.0,60.90,0,0},
	{3,"荷兰","范杜因-席琳",50.4,49.3,60.80,0,0},
	{4,"英国","图尔森",63.0,37.8,62.40,0,0},
	{5,"英国","斯潘多利尼-西里耶克斯",58.5,60.8,63.00,0,0},
	{6,"马来西亚","潘德莱拉-帕姆",18.0,71.05,60.80,0,0},
	{7,"俄罗斯","季莫申宁娜-尤利娅",46.5,57.75,44.80,0,0},
	{8,"澳大利亚","梅丽莎-吴",75.0,76.8,64.40,0,0},
	{9,"墨西哥","阿贡德斯-加西亚",64.5,70.95,73.60,0,0},
	{10,"美国","施奈尔",76.8,65.6,56.10,0,0},
	{11,"中国","陈芋汐",82.5,76.8,85.80,0,0},
	{12,"中国","全红禅",82.5,96.0,95.70,0,0}};
	    for(i=0;i<12;i++)
    printf("%2d%17s\t%-16s\t%10.2f%11.2f%11.2f%11.2f%10.2f%10.2f\n\n",e[i].k,e[i].country,e[i].name,e[i].score1,e[i].score2,e[i].score3,e[i].score4,e[i].score5,e[i].total=e[i].score1+e[i].score2+e[i].score3+e[i].score4+e[i].score5);
    printf("********************************************************第三轮排序********************************************************\n\n");
	printf("%s %16s\t%4s\t%25s%18s\n\n",a.li,a.cou,a.lift,a.t,a.paixu);
	    struct information t2;
	
        int l2,r2;
        for(l2=0;l2<11;l2++)
    {
    h=l2;
    	for(r2=l2+1;r2<12;r2++)
    	if(e[r2].total>e[h].total)
    h=r2;
    t2=e[h];e[h]=e[l2];e[l2]=t2;
    }
        for(i=0;i<12;i++)
    printf("%2d%17s\t%-16s\t%10.2f\t%10d\n\n",e[i].k,e[i].country,e[i].name,e[i].total,jk[i]);    
    printf("********************************************************第四轮记分********************************************************\n\n");
    printf("%s %16s\t%10s\t%20s %s %s %s %s %s\n\n",a.li,a.cou,a.lift,a.yi,a.er,a.san,a.si,a.wu,a.t);	
	    struct information f[12]={{1,"墨西哥","奥罗斯科-洛萨",66.0,57.6,54.45,75.20,0},
	{2,"德国","纬纱",67.2,63.0,60.90,40.00,0},
	{3,"荷兰","范杜因-席琳",50.4,49.3,60.80,60.00,0},
	{4,"英国","图尔森",63.0,37.8,62.40,62.40,0},
	{5,"英国","斯潘多利尼-西里耶克斯",58.5,60.8,63.00,51.20,0},
	{6,"马来西亚","潘德莱拉-帕姆",18.0,71.05,60.80,52.80,0},
	{7,"俄罗斯","季莫申宁娜-尤利娅",46.5,57.75,44.80,49.60,0},
	{8,"澳大利亚","梅丽莎-吴",75.0,76.8,64.40,73.60,0},
	{9,"墨西哥","阿贡德斯-加西亚",64.5,70.95,73.60,74.25,0},
	{10,"美国","施奈尔",76.8,65.6,56.10,79.50,0},
	{11,"中国","陈芋汐",82.5,76.8,85.80,89.10,0},
	{12,"中国","全红禅",82.5,96.0,95.70,96.00,0}};
	    for(i=0;i<12;i++)
    printf("%2d%17s\t%-16s\t%10.2f%11.2f%11.2f%11.2f%10.2f%10.2f\n\n",f[i].k,f[i].country,f[i].name,f[i].score1,f[i].score2,f[i].score3,f[i].score4,f[i].score5,f[i].total=f[i].score1+f[i].score2+f[i].score3+f[i].score4+f[i].score5);    
    printf("********************************************************第四轮排序********************************************************\n\n");
	printf("%s %16s\t%4s\t%25s%18s\n\n",a.li,a.cou,a.lift,a.t,a.paixu);	
	    struct information t3;
	
        int l3,r3;
        for(l3=0;l3<11;l3++)
    {
    h=l3;
    	for(r3=l3+1;r3<12;r3++)
    	if(f[r3].total>f[h].total)
    h=r3;
    t3=f[h];f[h]=f[l3];f[l3]=t3;
    }
        for(i=0;i<12;i++)
    printf("%2d%17s\t%-16s\t%10.2f\t%10d\n\n",f[i].k,f[i].country,f[i].name,f[i].total,jk[i]);    
    printf("********************************************************第五轮记分********************************************************\n\n");
    printf("%s %16s\t%10s\t%20s %s %s %s %s %s\n\n",a.li,a.cou,a.lift,a.yi,a.er,a.san,a.si,a.wu,a.t);	
	    struct information g[12]={{1,"墨西哥","奥罗斯科-洛萨",66.0,57.6,54.45,75.20,68.80},
	{2,"德国","纬纱",67.2,63.0,60.90,40.00,60.80},
	{3,"荷兰","范杜因-席琳",50.4,49.3,60.80,60.00,67.20},
	{4,"英国","图尔森",63.0,37.8,62.40,62.40,64.00},
	{5,"英国","斯潘多利尼-西里耶克斯",58.5,60.8,63.00,51.20,72.00},
	{6,"马来西亚","潘德莱拉-帕姆",18.0,71.05,60.80,52.80,43.20},
	{7,"俄罗斯","季莫申宁娜-尤利娅",46.5,57.75,44.80,49.60,64.35},
	{8,"澳大利亚","梅丽莎-吴",75.0,76.8,64.40,73.60,81.60},
	{9,"墨西哥","阿贡德斯-加西亚",64.5,70.95,73.60,74.25,75.20},
	{10,"美国","施奈尔",76.8,65.6,56.10,79.50,62.40},
	{11,"中国","陈芋汐",82.5,76.8,85.80,89.10,91.20},
	{12,"中国","全红禅",82.5,96.0,95.70,96.00,96.00}};
	    for(i=0;i<12;i++)
    printf("%2d%17s\t%-16s\t%10.2f%11.2f%11.2f%11.2f%10.2f%10.2f\n\n",g[i].k,g[i].country,g[i].name,g[i].score1,g[i].score2,g[i].score3,g[i].score4,g[i].score5,g[i].total=g[i].score1+g[i].score2+g[i].score3+g[i].score4+g[i].score5);
    printf("********************************************************第五轮排序********************************************************\n\n");
	printf("%s %16s\t%4s\t%25s%18s\n\n",a.li,a.cou,a.lift,a.t,a.paixu);	
	    struct information t4;
	
        int l4,r4;
        for(l4=0;l4<11;l4++)
    {
    h=l4;
    	for(r4=l4+1;r4<12;r4++)
    	if(g[r4].total>g[h].total)
    h=r4;
    t4=g[h];g[h]=g[l4];g[l4]=t4;
    }
        for(i=0;i<12;i++)
    printf("%2d%17s\t%-16s\t%10.2f\t%10d\n\n",g[i].k,g[i].country,g[i].name,g[i].total,jk[i]);    
        return 0;
}
